import { PaginationInfo } from "./pagination-info";

export class OperationLogs {
    data: string[] =  [
        'قام احمد بسحب المنتج شيبس عدد 5 بتاريخ 2/7/2023',
        'قام خالد بادخال منتج جديد بأسم حاويات عدد 1 بتاريخ 1/7/2023',
        'قام خالد بالموافقة على طلب سلاسل امداد خارجية من المستودع الطائر بمنتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',
        'قام المستودع الطائر بطلب سلاسل امداد خارجية منتج شيبس عدد 1',

      ];
    paginate: PaginationInfo = new PaginationInfo();

    // UI properties
    pagesCount:number =  0;
    pages: number[] = [];
    selectedPage: number = 1;
    // takes the reference for the last selected page before deletion, 
    //so when reloading the data the navigator will stay on the same page with the right data
    lastSelectedPage: number | null = null; 
    minPage: number = 1;

    paginatedData:string[] = [];
}